[
    {
        "title": "Il risveglio",
        "scene_image": "./assets/images/parco_chiuso.jpg",
        "dialogue": [
            {
                "type": "narrator",
                "text": "Una sirena suona. Tommaso, si sveglia di colpo su una panchina, confuso e disorientato."
            },
            {
                "type": "speaking",
                "speaker": "Tommaso",
                "text": "Dove sono...? Oh no, il parco è chiuso!"
            },
            {
                "type": "narrator",
                "text": "Tommaso si alza e inizia a guardarsi attorno. Il parco è avvolto nell’oscurità, con alcune luci intermittenti in lontananza."
            },
            {
                "type": "speaking",
                "speaker": "Tommaso",
                "text": "Devo trovare un modo per uscire... ma da dove inizio?"
            }
        ]
    },
    {
        "title": "Primo enigma - La Ruota Panoramica",
        "dialogue": [
            {
                "type": "narrator",
                "text": "Tommaso si avvicina alla ruota panoramica, che appare spenta e immobile."
            },
            {
                "type": "speaking",
                "speaker": "Tommaso",
                "text": "Cos'è questa etichetta?"
            },
            {
                "type": "speaking",
                "speaker": "Tommaso",
                "text": "Sì! Funziona!"
            },
            {
                "type": "narrator",
                "text": "La ruota panoramica sale in alto e, da lassù, Tommaso osserva il parco immerso nell'oscurità."
            },
            {
                "type": "narrator",
                "text": "Solo un edificio è illuminato: un piccolo ufficio al margine del parco."
            },
            {
                "type": "speaking",
                "speaker": "Tommaso",
                "text": "Un ufficio illuminato... forse c’è qualcuno lì che mi può aiutare. Devo raggiungerlo."
            },
            {
                "type": "narrator",
                "text": "La ruota si ferma, Tommaso scende e si dirige verso l'ufficio."
            }
        ]
    },
    {
        "title": "L'incontro col custode",
        "dialogue": [
            {
                "type": "narrator",
                "text": "Mentre Tommaso si dirige verso l'ufficio, incontra uno strano Tizio."
            },
            {
                "type": "narrator",
                "text": "È Leo, il custode del parco insieme al suo fedele cane Argo."
            }
        ]
    },
    {
        "title": "Scelta 1: Parlare con Leo",
        "dialogue": [
            {
                "type": "speaking",
                "speaker": "Leo",
                "text": "Ehi, che ci fai qui, ragazzo? Il parco è chiuso! Non dovresti essere qui a quest'ora."
            },
            {
                "type": "speaking",
                "speaker": "Tommaso",
                "text": "Non lo so nemmeno io... mi sono addormentato e ora sono bloccato qui. Come faccio a uscire?"
            },
            {
                "type": "speaking",
                "speaker": "Leo",
                "text": "Ah, i cancelli si chiudono automaticamente dopo una certa ora. Non si riaprono fino all’alba, quindi temo che dovrai venire con me."
            },
            {
                "type": "narrator",
                "text": "Mentre i due parlano, un verso agghiacciante si sente provenire da fuori. Leo si irrigidisce e si affretta verso la porta. "
            },
            {
                "type": "narrator",
                "text": "Tommaso è visibilmente preoccupato."
            },
            {
                "type": "speaking",
                "speaker": "Leo",
                "text": "Coraggio, andiamo nel mio ufficio. Lì sarai al sicuro."
            },
            {
                "type": "narrator",
                "text": "Leo afferra bruscamente Tommaso e lo accompagna nel suo ufficio, chiudendo la porta a chiave."
            }
        ]
    },
    {
        "title": "Scelta 2: Scappare",
        "dialogue":[
            {
                "type": "narrator",
                "text": "Tommaso corre all'impazzata, senza una meta precisa."
            },
            {
                "type": "speaking",
                "speaker": "Tommaso",
                "text": "Non devo voltarmi, non devo voltarmi!!! Devo solo pensare a come uscire da qui"
            },
            {
                "type": "speaking",
                "speaker": "Tommaso",
                "text": "Non ce la faccio più, se mi fermo adesso, mi sbranerà. Aiuuutoo!!!"
            },
            {
                "type": "speaking",
                "speaker": "Tommaso",
                "text": "Non ho più speranze…. Sto per cadere. Addio a tutti!!!"
            },
            {
                "type": "narrator",
                "text": "Tommaso si ferma all'improvviso, è esausto. Nota con stupore che Argo non lo sta più inseguendo."
            }
        ]
    },
    {
        "title": "Secondo enigma – Statua e fontana",
        "dialogue": [
            {
                "type": "narrator",
                "text": "Tommaso si ritrova davanti ad una fontana e nota una statua al centro, rappresentante un uomo anziano con le mani tese, pronte a ricevere qualcosa. Legge la scritta alla base:"
            },
            {
                "type": "hint",
                "speaker": "Scritta sulla statua",
                "text": "Fammi un dono e mi inchinerò mostrandoti la via."
            },
            {
                "type": "narrator",
                "text": "Accanto alla fontana, Tommaso vede un pannello con delle valvole e un cartello"
            },
            {
                "type": "hint",
                "speaker": "Cartello",
                "text": "Non toccare, solo personale autorizzato."
            },
            {
                "type": "narrator",
                "text": "Tommaso esamina il pannello e vede una grande valvola che può essere ruotata."
            }
        ]
    },
    {
        "title": "Secongo enigma – Statua e fontana vuota",
        "dialogue": [
            {
                "type": "narrator",
                "text": "Tommaso gira la valvola e la fontana si svuota."
            },
            {
                "type": "speaking",
                "speaker": "Tommaso",
                "text": "Una moneta! Forse va messa qui..."
            },
            {
                "type": "narrator",
                "text": "Tommaso recupera la moneta dalla vasca e va a posizionarla sulle mani della statua."
            },
            {
                "type": "narrator",
                "text": "Non appena la moneta viene posizionata, la statua si muove, piegandosi lentamente in avanti. Sotto la base della statua, si apre un vano segreto."
            },
            {
                "type": "narrator",
                "text": "Rinviene un logoro diario, scritto da un vecchio custode del parco."
            }
        ]
    },
    {
        "title": "Terzo enigma: il Tunnel",
        "dialogue": [
            {
                "type": "narrator",
                "text": "Tommaso raggiunge il tunnel. Avanza lungo il tunnel, con le pareti umide e scure lo circondano, e la luce che filtra è sempre più fioca."
            },
            {
                "type": "narrator",
                "text": "Dopo qualche passo, si trova di fronte a un vicolo cieco bloccato da enormi massi. Non può passare e deve trovare un modo per proseguire."
            },
            {
                "type": "narrator",
                "text": "La sua attenzione viene attirata da un baule arrugginito, posto in un angolo del tunnel, con un lucchetto a combinazione che lo chiude ermeticamente."
            },
            {
                "type": "speaking",
                "speaker": "Tommaso",
                "text": "Chissà cosa c’è dentro… Ma come faccio ad aprirlo?"
            },
            {
                "type": "speaking",
                "speaker": "Tommaso",
                "text": "Chissà cosa c’è dentro… Ma come faccio ad aprirlo?"
            },
            {
                "type": "narrator",
                "text": "Il baule si apre. Tommaso solleva il coperchio del baule e trova un accendino e la dinamite, che può usare per rimuovere i massi che bloccano la via."
            },
            {
                "type": "speaking",
                "speaker": "Tommaso",
                "text": "Finalmente! Posso proseguire!"
            }
        ]
    },
    {
        "title": "Epilogo",
        "dialogue": [
            {
                "type": "narrator",
                "text": "Il sole sorgeva lentamente all'orizzonte, tinto di calde sfumature dorate e arancioni. Tommaso si svegliò, il cuore ancora pulsante dall'adrenalina della notte trascorsa."
            },
            {
                "type": "narrator",
                "text": "Non riusciva a smettere di pensare all'avventura vissuta e a quanto fosse stato straordinario esplorare il parco. Una curiosità irrefrenabile lo portò a tornare."
            },
            {
                "type": "narrator",
                "text": "Mentre camminava lungo i sentieri familiari, ogni angolo evocava ricordi: l'urlo spaventoso, l'incontro con Leo, il mistero del tunnel. Con ogni passo, il parco sembrava rivelargli un nuovo segreto, facendolo sentire grato per l'esperienza."
            },
            {
                "type": "narrator",
                "text": "Finalmente, Tommaso raggiunse una piccola radura dove, al centro, sorgeva una statua. Avvicinandosi, scoprì che la statua rappresentava Leo e il suo fedele cane Argo. Leo era raffigurato con un sorriso gentile, mentre Argo si ergeva al suo fianco, fiero e protettivo."
            }
        ]
    }
]